---
kind: method
id: M:Autodesk.Revit.DB.TableCellStyleOverrideOptions.Dispose
source: html/d623ca6c-8169-a481-d508-47bffe1b4c74.htm
---
# Autodesk.Revit.DB.TableCellStyleOverrideOptions.Dispose Method

Releases all resources used by the TableCellStyleOverrideOptions

## Syntax (C#)
```csharp
public void Dispose()
```